import hydro from "../assets/baby1.jpeg";
import "../styles/hydrotherapy.css";
import ContactForm from "./Contact-form";
import BubblesBackground from "./BubblesBackground";

export default function HydrotherapyPage() {
  return (
    <div className="service-page">
      <div className="hero">
        <img src={hydro} alt="Υδροθεραπεία" />
        <div className="hero-overlay">
          <h1>Υδροθεραπεία | 40 ημέρων – 3 ετών</h1> 
          
        </div>
      </div>

      <div className="content">
        <h2>Μια μοναδική εμπειρία χαλάρωσης και ευεξίας</h2>
        <p>
          Η απαλότητα του ζεστού νερού, σε συνδυασμό με την ελεύθερη κίνηση του σώματος,
          δημιουργεί ένα συναίσθημα οικειότητας για το μωρό, θυμίζοντάς του τη μήτρα της μητέρας.
          Αυτή η εμπειρία υποστηρίζει τη νευρολογική, μυοσκελετική και συναισθηματική ανάπτυξη
          του βρέφους, ενώ ενδυναμώνει τη φυσική σχέση του με το νερό και την αυτοπεποίθησή του. 
        </p>

        <h2>Οφέλη Υδροθεραπείας</h2>
        <ul>
          <li>Δημιουργεί αίσθημα ασφάλειας και αυτοπεποίθησης στο μωρό.</li>
          <li>Ηρεμεί μέσω χαλαρωτικής μουσικής & απαλά χρώματα που αναπτύσσουν αισθητηριακά το μωρό. </li>
          <li>Ενδυναμώνει το αναπνευστικό και το καρδιαγγειακό σύστημα μέσω της φυσικής πίεσης του νερού. </li>
          <li>Βελτιώνει ισορροπία, δύναμη, ευλυγισία, ενισχύοντας μύες, οστά και συντονισμό. </li>
          <li>Ενισχύει το ανοσοποιητικό, ειδικά το χειμώνα, και βοηθά στην ανάρρωση από ιώσεις. </li>
          <li>Ανακουφίζει από κολικούς και δυσκοιλιότητα μέσω ήπιων κινήσεων στο νερό.</li>
          <li>Ενεργοποιεί την παραγωγή β-ενδορφινών — ορμονών ευτυχίας, προσφέροντας ηρεμία και αίσθημα ευεξίας.</li>
          <li>Βελτιώνει την ποιότητα ύπνου, ώστε το μωρό να κοιμάται πιο βαθιά και ξεκούραστα. </li>
          <li>Προωθεί στιγμές τρυφερότητας και σύνδεσης μεταξύ γονέα και μωρού.</li>
        </ul>

        <h2>Πληροφορίες Συνεδριών</h2>
        <ul>
          <li>Κατάλληλο για βρέφη από 40 ημέρων έως 3 ετών. </li>
          <li>Χρήση ειδικών σωσιβίων σχεδιασμένων για ασφάλεια και άνεση. </li>
          <li>Περιλαμβάνεται αδιάβροχη πάνα μιας χρήσης. </li>
          <li>Συνεδρίες υπό την επίβλεψη εξειδικευμένων επαγγελματιών.</li>
          <li>Συμβουλή: Φέρτε μαζί μία απαλή πετσέτα και ένα σνακ ή γάλα — η υδροθεραπεία ανοίγει την όρεξη! </li>
        </ul>
      </div>

      <BubblesBackground />
      <ContactForm />
    </div>
  );
}
