import { useEffect } from "react";
import { useLocation } from "react-router-dom";

import massageImage from "../assets/massage.jpeg";
import "../styles/massage.css";
import ContactForm from "./Contact-form";
import BubblesBackground from "./BubblesBackground";

export default function MassagePage() {
  const { pathname } = useLocation();

  useEffect(() => {
    window.scrollTo(0, 0);
  }, [pathname]);
  return (
    <div className="service-page">
      <div className="hero">
        <img src={massageImage} alt="Βρεφικό Μασάζ" />
        <div className="hero-overlay">
          <h1>Βρεφικό Μασάζ</h1>
        </div>
      </div>

      <div className="content">
        <h2>Οφέλη για το μωρό</h2>
        <p>
          Η βρεφική μασάξη προσφέρει πολλαπλά οφέλη στη φυσική και συναισθηματική ανάπτυξη του
          μωρού:
        </p>
        <ul>
          <li><b>Βελτιώνει τον ύπνο</b>και μειώνει την ανησυχία, βοηθώντας το μωρό να χαλαρώσει πιο
            εύκολα.</li>
          <li><b>Ανακουφίζει από κολικούς και δυσκοιλιότητα</b>, μέσω απαλών κινήσεων που βοηθούν
            την πέψη.</li>
          <li><b>Ενισχύει το ανοσοποιητικό σύστημα</b>, υποστηρίζοντας τη συνολική υγεία του μωρού.</li>
          <li><b>Συμβάλλει στην κινητική ανάπτυξη</b>, διευκολύνοντας τη χαλάρωση των μυών και την
            ευλυγισία.</li>
          <li>
            <b>Προάγει τη συναισθηματική ευημερία</b>, ενισχύοντας την αίσθηση ασφάλειας και
            αυτοπεποίθησης.
          </li>
        </ul>

        <h2>Οφέλη για τον Γονέα</h2>
        <p>Η βρεφική μάλαξη προσφέρει σημαντικά οφέλη και στους γονείς:</p>
        <ul>
          <li><b>Ενισχύει τη σύνδεση και το δεσμό με το μωρό</b>, δημιουργώντας κοινές στιγμές αγάπης
            και τρυφερότητας.</li>
          <li><b>Μειώνει το άγχος και την πιθανότητα κατάθλιψης μετά τον τοκετό</b>, προσφέροντας
            στιγμές χαλάρωσης και ηρεμίας.</li>
          <li><b>Αυξάνει την εμπιστοσύνη στις γονεϊκές ικανότητες</b>, βοηθώντας τους γονείς να
            κατανοήσουν καλύτερα τις ανάγκες του μωρού τους.</li>
        </ul>

        <h2>Πρακτικές Συμβουλές</h2>
        <p>Για να είναι η βρεφική μάλαξη ασφαλές και ευχάριστη:</p>
        <ul>
          <li>Χρησιμοποιείτε <b>ήπια, κυκλικά χτυπήματα</b> με τα δάχτυλα ή τις παλάμες,
            προσαρμοσμένα στην ηλικία και ευαισθησία του μωρού.</li>
          <li>Επιλέξτε<b> ήρεμο περιβάλλον</b> και κατάλληλη ώρα, όταν το μωρό είναι ξύπνιο αλλά
            χαλαρό.</li>
          <li>Αποφύγετε το μασάζ <b>μετά από γεύμα</b> ή όταν το μωρό είναι υπερβολικά κουρασμένο ή
            ανήσυχο.</li>
          <li>Μπορείτε να ενσωματώσετε <b>απαλή μουσική, χαμηλό φωτισμό και άρωμα
            χαλαρωτικού ελαίου</b> για ακόμα πιο ευχάριστη εμπειρία.</li>
        </ul>
      </div>

      <BubblesBackground />
      <ContactForm />
    </div>
  );
}
