import yogaMamaMwro from '../assets/Yoga μαμά & παιδί.jpg';
import "../styles/party.css";
import ContactForm from "./Contact-form";
import BubblesBackground from "./BubblesBackground";
import { useEffect } from "react";
import { useLocation } from "react-router-dom";
export default function YogaMamaMwro() {
    const { pathname } = useLocation();
    useEffect(() => {
        window.scrollTo(0, 0);
    }, [pathname]);
    return (
        <div className="service-page">
            {/* Hero Section */}
            <div className="hero">
                <img src={yogaMamaMwro} alt="Baby Spa Fit For Birth" loading="lazy" />
                <div className="hero-overlay">
                    <h1>Yoga Μαμά Μωρό</h1>
                </div>
            </div>

            {/* Content Section */}
            <div className="content">
                <h2>Γιόγκα για μαμάδες και μωρά</h2>
                <p>
                    Οι πρώτες εβδομάδες με το μωρό είναι μαγικές, αλλά ταυτόχρονα απαιτητικές.
                    Μεταξύ θηλασμού, αλλαγής πάνας και ελάχιστου ύπνου, ο χρόνος για τον εαυτό
                    σας φαίνεται να εξαφανίζεται. Η γιόγκα για μαμάδες και μωρά είναι μια ευκαιρία
                    να χαλαρώσετε μαζί, να αναζωογονηθείτε και να απολαύσετε στιγμές σύνδεσης με
                    το μωρό σας.</p>

                <p>Σε ένα ζεστό και φιλικό περιβάλλον, οι απαλές ασκήσεις γιόγκα έχουν σχεδιαστεί
                    ειδικά για τη μεταγεννητική περίοδο. Βοηθούν στην ενδυνάμωση του πυελικού
                    εδάφους, στη χαλάρωση των τεταμένων ώμων και του αυχένα, και στην
                    επαναφορά της ευεξίας σας. Το μωρό σας συμμετέχει με παιχνιδιάρικο τρόπο, είτε
                    παρακολουθώντας τις ασκήσεις είτε παίρνοντας μέρος σε αυτές.</p>

                <p>
                    Δεν χρειάζεται τελειότητα, το σημαντικό είναι να αφιερώσετε λίγο χρόνο στον
                    εαυτό σας και να ενισχύσετε τον δεσμό σας με το μωρό.
                </p>

                <p>
                    Οι μαίες που θα σας καθοδηγήσουν: <br />
                    Οι Olympian Midwives, ειδικές στη φυσιολογική εγκυμοσύνη και τοκετό,
                    εκπαιδευμένες στη postnatal γιόγκα και γυμναστική.
                </p>

                <p>
                    Λεπτομέρειες συμμετοχής:
                </p>
                <ul>
                    <li>Από 6-8 εβδομάδες μετά από φυσιολογικό τοκετό</li>
                    <li>Από 12 εβδομάδες μετά από καισαρική τομή</li>
                    <li>Οκτώ χαλαρές Δευτέρες στις 11:00, διάρκειας μίας ώρας η καθεμία</li>
                    <li>Το πρώτο μάθημα είναι δοκιμαστικό</li>
                </ul>

                <p>
                    Τι χρειάζεται να φέρετε: <br />
                    Το μωρό σας, μια κουβέρτα για το μωρό και μια μεγάλη πετσέτα για εσάς. Φέρτε
                    μαζί τα απαραίτητα για τη φροντίδα του μωρού (πάνες, αλλαξιές κ.ά.).
                </p>
                <p>Εκτός από τις ασκήσεις γιόγκα, θα υπάρχει χρόνος για συζητήσεις με άλλες
                    μαμάδες. Ακόμα και μόνο το να μοιραστείτε εμπειρίες και να συνειδητοποιήσετε
                    ότι δεν είστε μόνες στις μικρές και μεγάλες προκλήσεις της μητρότητας, μπορεί να
                    φέρει μεγάλη ανακούφιση και σύνδεση.</p>

                <p>Σας ενδιαφέρει; Δηλώστε συμμετοχή! <br />
                    Ανυπομονούμε να σας γνωρίσουμε και να ζήσουμε μαζί όμορφες στιγμές!</p>

            </div>

            <BubblesBackground />
            <ContactForm />
        </div>
    );
}
