import yogaMamaMwro from '../assets/Yoga μαμά & παιδί.jpg';
import "../styles/party.css";
import ContactForm from "./Contact-form";
import BubblesBackground from "./BubblesBackground";
import { useEffect } from "react";
import { useLocation } from "react-router-dom";
export default function YogaMamaMwro() {
    const { pathname } = useLocation();
    useEffect(() => {
        window.scrollTo(0, 0);
    }, [pathname]);
    return (
        <div className="service-page">
            {/* Hero Section */}
            <div className="hero">
                <img src={yogaMamaMwro} alt="Baby Spa Fit For Birth" loading="lazy" />
                <div className="hero-overlay">
                    <h1>Yoga Μαμά Μωρό</h1>
                </div>
            </div>

            {/* Content Section */}
            <div className="content">
                <h2>Γιόγκα για μαμάδες και μωρά</h2>
                <p>
                   Οι πρώτες εβδομάδες με το μωρό σας είναι γεμάτες αγάπη, θαυμασμό και νέες
εμπειρίες. Μαζί όμως φέρνουν και κόπωση, αλλαγές και την ανάγκη για λίγη
φροντίδα και για εσάς.</p>

                <p>Η γιόγκα για μαμάδες και μωρά είναι μια τρυφερή ευκαιρία να αφιερώσετε χρόνο
στον εαυτό σας, ενώ παραμένετε συνδεδεμένες με το μωρό σας. Μέσα σε ένα
ζεστό και φιλικό περιβάλλον, οι απαλές ασκήσεις βοηθούν το σώμα να ανακτήσει
δύναμη και ισορροπία, ενώ χαλαρώνουν τον νου και την καρδιά.</p>

                <p>
                    Το μωρό σας συμμετέχει φυσικά και χαρούμενα, άλλοτε μέσα από την κίνηση,
άλλοτε μέσα από το βλέμμα και την αγκαλιά. Κάθε άσκηση είναι μια μικρή στιγμή
επικοινωνίας, γέλιου και αγάπης.
                </p>

                <p>
                   Η φροντίδα και καθοδήγηση προσφέρεται από τις Olympian Midwives, μαίες με
εξειδίκευση στη φυσιολογική εγκυμοσύνη, τον τοκετό και τη μεταγεννητική
γιόγκα, που θα σας στηρίξουν με ευαισθησία και γνώση σε αυτό το όμορφο ταξίδι.
                </p>

                <p>
                    Κάθε συνάντηση είναι μια ανάσα, μια υπενθύμιση ότι δεν είστε μόνες. Θα έχετε
την ευκαιρία να μοιραστείτε εμπειρίες, συναισθήματα και στιγμές με άλλες
μαμάδες που βιώνουν τα ίδια πρώτα, μαγικά βήματα της μητρότητας.
                </p>

                <p>
                   Αφιερώστε λίγο χρόνο σε εσάς. Αγκαλιάστε το σώμα σας, το μωρό σας, και τη νέα
σας καθημερινότητα με αγάπη. <br />
Ανυπομονούμε να σας γνωρίσουμε και να μοιραστούμε μαζί όμορφες, γαλήνιες
στιγμές.</p>

            </div>

            <BubblesBackground />
            <ContactForm />
        </div>
    );
}
